import typing
import collections


class Config:
    accents: typing.Dict[str, str]
    tones: collections.OrderedDict
    statistic: collections.OrderedDict
    grams_1: collections.OrderedDict
    grams_2: collections.OrderedDict
    size_1_gram: int
    total_count_1_gram: int
    max_word_length: int

    maxp: int
    """
        So luong tu lon nhat  trong cau
        """
    size_2_grams: int
    total_count_2_grams: int
    MIN: float
    space: bytes


__config__: typing.Optional[Config] = None
__accents_chars__ = (f"ÙÚỦỤŨƯỪỨỬỰỮ"
                     f"èéẻẹẽêềếểệễ"
                     f"òóỏọõôồốổộỗơờớởợỡ"
                     f"ÒÓỎỌÕÔỒỐỔỘỖƠỜỚỞỢỠ"
                     f"ùúủụũưừứửựữ"
                     f"àáảạãâầấẩậẫăằắẳặẵ"
                     f"ÀÁẢẠÃÂẦẤẨẬẪĂẰẮẲẶẴ"
                     f"ìíỉịĩÈÉẺẸẼÊỀẾỂỆỄ"
                     f"ỲÝỶỴỸÌÍỈỊĨ"
                     f"ỳýỷỵỹ")

__full_accents__ = (f"UÙÚỦỤŨƯỪỨỬỰỮ"
                    f"eèéẻẹẽêềếểệễ"
                    f"oòóỏọõôồốổộỗơờớởợỡ"
                    f"OÒÓỎỌÕÔỒỐỔỘỖƠỜỚỞỢỠ"
                    f"uùúủụũưừứửựữ"
                    f"aàáảạãâầấẩậẫăằắẳặẵ"
                    f"AÀÁẢẠÃÂẦẤẨẬẪĂẰẮẲẶẴ"
                    f"iìíỉịĩ"
                    f"EÈÉẺẸẼÊỀẾỂỆỄ"
                    f"YỲÝỶỴỸ"
                    f"IÌÍỈỊĨ"
                    f"yỳýỷỵỹ")
__clear_accents_map__ = {'Ù': 'U', 'Ú': 'U', 'Ủ': 'U', 'Ụ': 'U', 'Ũ': 'U', 'Ư': 'U', 'Ừ': 'U', 'Ứ': 'U',
                         'Ử': 'U', 'Ự': 'U', 'Ữ': 'U', 'è': 'e', 'é': 'e', 'ẻ': 'e', 'ẹ': 'e', 'ẽ': 'e',
                         'ê': 'e', 'ề': 'e', 'ế': 'e', 'ể': 'e', 'ệ': 'e', 'ễ': 'e', 'ò': 'o', 'ó': 'o',
                         'ỏ': 'o', 'ọ': 'o', 'õ': 'o', 'ô': 'o', 'ồ': 'o', 'ố': 'o', 'ổ': 'o', 'ộ': 'o',
                         'ỗ': 'o', 'ơ': 'o', 'ờ': 'o', 'ớ': 'o', 'ở': 'o', 'ợ': 'o', 'ỡ': 'o', 'Ò': 'O',
                         'Ó': 'O', 'Ỏ': 'O', 'Ọ': 'O', 'Õ': 'O', 'Ô': 'O', 'Ồ': 'O', 'Ố': 'O', 'Ổ': 'O',
                         'Ộ': 'O', 'Ỗ': 'O', 'Ơ': 'O', 'Ờ': 'O', 'Ớ': 'O', 'Ở': 'O', 'Ợ': 'O', 'Ỡ': 'O',
                         'ù': 'u', 'ú': 'u', 'ủ': 'u', 'ụ': 'u', 'ũ': 'u', 'ư': 'u', 'ừ': 'u', 'ứ': 'u',
                         'ử': 'u', 'ự': 'u', 'ữ': 'u', 'à': 'a', 'á': 'a', 'ả': 'a', 'ạ': 'a', 'ã': 'a',
                         'â': 'a', 'ầ': 'a', 'ấ': 'a', 'ẩ': 'a', 'ậ': 'a', 'ẫ': 'a', 'ă': 'a', 'ằ': 'a',
                         'ắ': 'a', 'ẳ': 'a', 'ặ': 'a', 'ẵ': 'a', 'À': 'A', 'Á': 'A', 'Ả': 'A', 'Ạ': 'A',
                         'Ã': 'A', 'Â': 'A', 'Ầ': 'A', 'Ấ': 'A', 'Ẩ': 'A', 'Ậ': 'A', 'Ẫ': 'A', 'Ă': 'A',
                         'Ằ': 'A', 'Ắ': 'A', 'Ẳ': 'A', 'Ặ': 'A', 'Ẵ': 'A', 'ì': 'i', 'í': 'i', 'ỉ': 'i',
                         'ị': 'i', 'ĩ': 'i', 'È': 'E', 'É': 'E', 'Ẻ': 'E', 'Ẹ': 'E', 'Ẽ': 'E', 'Ê': 'E',
                         'Ề': 'E', 'Ế': 'E', 'Ể': 'E', 'Ệ': 'E', 'Ễ': 'E', 'Ỳ': 'Y', 'Ý': 'Y', 'Ỷ': 'Y',
                         'Ỵ': 'Y', 'Ỹ': 'Y', 'Ì': 'I', 'Í': 'I', 'Ỉ': 'I', 'Ị': 'I', 'Ĩ': 'I', 'ỳ': 'y',
                         'ý': 'y', 'ỷ': 'y', 'ỵ': 'y', 'ỹ': 'y'}
__clear_accents_map__.update({
    'e': 'e', 'y': 'y', 'u': 'u', 'i': 'i', 'o': 'o', 'a': 'a',
    'E': 'E', 'Y': 'Y', 'U': 'U', 'I': 'I', 'O': 'O', 'A': 'A'
})
__tones__ = {
    "iay": ["iẩy", "iâý", "iẫy", "iay", "iấy", "iày", "ìay", "iầy", "iáy", "iãy", "iạy", "iây", "iảy"],
    "uy": ["ùy", "uý", "uỹ", "uy", "úy", "ụy", "uỳ", "ũy", "ủy", "uỵ", "uỷ"],
    "oa": ["oâ", "oẳ", "oặ", "oà", "óa", "õa", "oằ", "oẫ", "oã", "ọa", "oắ", "oă", "oả", "oẵ", "òa", "oa", "ỏa", "oạ",
           "oá"],
    "oi": ["ối", "ỏi", "ọi", "ời", "ói", "ỡi",
           "õi", "ợi", "ôi", "ồi", "òi", "ơí", "ơi", "oi", "ỗi",
           "ổi", "ội", "ởi", "ới"],
    "a": ["ạ", "ã", "â", "ẳ", "ặ", "a", "ẩ", "ấ", "ă", "ả", "à", "ẵ", "á", "ắ", "ẫ", "ằ", "ầ", "ậ"],
    "ua": ["uậ", "uă", "ưa", "uặ", "uắ", "úa", "ửa", "uẵ", "uẩ", "uá", "ùa", "ứa", "uẫ", "uà", "ũa", "ụa", "uầ", "ủa",
           "uấ", "uẳ", "uạ", "uả", "uằ", "ừa", "uã", "ựa", "ữa", "uâ", "ua"],
    "o": ["ớ", "ỗ", "ổ", "ơ", "ố", "ò", "õ", "ộ", "ở", "ô", "ợ", "ọ", "ỡ", "ỏ", "o", "ồ", "ó", "ờ"],
    "uu": ["ứu", "ựu", "ưu", "ửu", "ữu", "ừu"],
    "uo": ["ưở", "uỡ", "uớ", "ượ", "ưỡ", "uở", "ươ", "uờ", "uổ", "uỗ", "uô", "ườ", "ướ", "uồ", "uộ", "uợ", "uơ", "uố",
           "uọ"],
    "eo": ["ểo", "ẽo", "èo", "ẹo", "ẻo", "éo", "eo"],
    "oai": ["oai", "oải", "oàì", "oài", "oái", "oại", "oãi"],
    "yeu": ["yễu", "yêu", "yểu", "yệu", "yếu", "yeu", "yều"],
    "uou": ["ượu", "ươu"],
    "uoi": ["uội", "uôí", "uồi", "uổi", "uối", "ười", "ướí", "ườì", "ưỡi", "ượi", "uoi", "uỗi", "ươi", "ưới", "uôi"],
    "ieu": ["iểu", "iếu", "iệu", "iễu", "iêu", "iều"],
    "uay": ["uậy", "uảy", "uây", "uẩy", "uầy", "uấy", "uay", "uẫy", "uày"],
    "iu": ["iủ", "iụ", "iử", "iứ", "ỉu", "iư", "iừ", "íu", "ìu", "iú", "iữ", "iự", "iu", "ĩu", "iù", "ịu", "iũ"],
    "ia": ["iă", "ĩa", "iấ", "iặ", "iả", "ỉa", "iẳ", "iẵ", "iậ", "iắ", "iâ", "iầ", "iã", "iá", "iạ", "ịa", "ìa", "ià",
           "ía", "iẩ", "iằ", "iẫ", "ia"],
    "ou": ["ơu", "ớu", "ởu"],
    "ueo": ["ueo", "uẹo", "uéo", "uèo"],
    "ui": ["ừi", "ửi", "ữi", "ùi", "úi", "ũi", "ui", "ủi", "ưi", "ứi", "ựi", "uì", "ụi"],
    "iuo": ["iướ", "iươ", "iưò", "iuố", "iuộ", "iuồ", "iưỡ", "iườ", "iượ", "iưở"],
    "io": ["iỏ", "iồ", "iỡ", "iô", "iợ", "iố", "iộ", "iơ", "iọ", "ío", "io", "iờ", "iớ", "iỗ", "iở", "iò", "iổ", "iõ",
           "ió"],
    "e": ["ê", "e", "ề", "ế", "é", "ể", "ẹ", "ễ", "è", "ẻ", "ệ", "ẽ"],
    "ao": ["ăo", "ằo", "âo", "ắo", "ao", "ào", "áo", "ão", "ạo", "ậo", "ảo", "ấo"],
    "ue": ["uẻ", "uẹ", "ùe", "uè", "uể", "uế", "ue", "uẽ", "úe", "uề", "uê", "ué", "uễ", "uệ"],
    "iau": ["iàu"],
    "au": ["ãu", "ảu", "ậu", "ẩu", "ạu", "ầu", "àu", "ẫu", "ắu", "ấu", "au", "âu", "áu"],
    "uye": ["ưyễ", "uyê", "uyé", "uyẹ", "ưyê", "uyẻ", "uyế", "uyè", "uye", "uyễ", "uyề", "uyệ", "uyể", "uyẽ"],
    "ai": ["âi", "àì", "ại", "ăi", "ải", "ãi", "ẩi", "ấi", "ái", "ầi", "ài", "ắi", "ai", "ẫi"],
    "oay": ["oay", "oày", "oạy", "oáy", "oảy", "oãy"],
    "ioi": ["iới", "iời", "iỏi"],
    "uya": ["uyã", "ưya", "uyạ", "uyấ", "uya", "uyá", "uyả"],
    "eu": ["ệu", "ều", "êu", "ểu", "ếu"],
    "ay": ["ăy", "áy", "ậy", "ẫy", "ạy", "ảy", "ầy", "ắy", "ây", "ày", "ay", "ấy", "ãy", "ẩy"],
    "iai": ["iai", "iãi", "iại", "iảỉ", "iái", "iài", "iải"],
    "ye": ["yễ", "yẻ", "yề", "yệ", "yế", "yể", "yẽ", "yé", "yê"],
    "ieo": ["iẻo", "ieo"],
    "uao": ["uao", "uáo", "uào", "uạo"],
    "ie": ["iè", "iề", "ỉe", "ịe", "iẽ", "iễ", "ìe", "ĩe", "iẻ", "ie", "iê", "ìệ", "ỉệ", "iế", "iệ", "íe", "ié", "iể"],
    "uau": ["uạu", "uàu"],
    "oe": ["ọe", "oe", "oè", "oẹ", "ỏe", "oẽ", "oế", "óe", "oé", "oẻ", "òe", "õe", "oệ", "oề"],
    "i": ["i", "í", "ị", "ĩ", "ỉ", "ì"],
    "iao": ["iáo", "iao", "iạo", "iảo", "iào"],
    "iua": ["iua", "iữa", "iùa", "iứa", "iừa", "iụa", "iửa", "iựa", "iưa"],
    "y": ["ỷ", "ỵ", "ý", "ỳ", "y", "ỹ"],
    "uyo": ["uyồ", "uyo", "uyộ"],
    "uyu": ["uỷu", "uỵu", "uyu"],
    "uai": ["uãi", "uái", "uải", "uai", "uài", "uại"],
    "iui": ["iụi", "iữi", "iúi", "iùi", "iửi", "iứi", "iũi"],
    "u": ["ừ", "ủ", "ụ", "ữ", "ù", "ử", "ú", "ứ", "ũ", "u", "ư", "ự"],
}
__remove_gram_1_words = ["trườmg", "tromg"]
__invalid__ = ["w","z","j"]
__invalid_end__ = ["mg","r","q","w","s","f","j","k","l","z","x","v","b"]
__invalid_start_1__ = ["w","z","j"]


